# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-x-ReCalibration-P2 for Dental Disease Detection
# 缝合怪版本：HGNetv2-x Backbone + ReCalibrationFPN (P2-P5)

# Parameters
nc: 80  # 修改为您的类别数
scales: # 使用 x 级别的缩放
  # [depth, width, max_channels]
  x: [1.00, 1.00, 2048]

# Backbone: HGNetv2-x (来自标准 rtdetr-x.yaml)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 64]]  # 0-P2/4
  - [-1, 6, HGBlock, [64, 128, 3]]  # 1-Stage 1 (输出 P2, Stride 4)

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, HGBlock, [128, 512, 3]]
  - [-1, 6, HGBlock, [128, 512, 3, False, True]]  # 4-Stage 2 (输出 P3, Stride 8)

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 5-P3/16
  - [-1, 6, HGBlock, [256, 1024, 5, True, False]]  # cm, c2, k, light, shortcut
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]  # 10-Stage 3 (输出 P4, Stride 16)

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 11-P4/32
  - [-1, 6, HGBlock, [512, 2048, 5, True, False]]
  - [-1, 6, HGBlock, [512, 2048, 5, True, True]]  # 13-Stage 4 (输出 P5, Stride 32)

# Head: ReCalibrationFPN (适配 HGNetv2 的索引)
head:
  # --- 1. 处理 P5 (Layer 13) ---
  - [13, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 14 input_proj.P5
  - [-1, 1, AIFI, [2048, 8]] # 15 AIFI 放在 P5
  - [-1, 1, Conv, [256, 1, 1]]  # 16, Y5 (P5特征)

  # --- 2. 融合 P5 -> P4 (Layer 10) ---
  # P4 在 Backbone 中是 Layer 10
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 17 input_proj.P4
  - [[-1, 16], 1, SBA, []] # 18 SBA融合 (P4与P5)
  - [-1, 3, RepC3, [256, 0.5]] # 19, 输出 FPN_P4

  # --- 3. 融合 P4 -> P3 (Layer 4) ---
  # P3 在 Backbone 中是 Layer 4
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 20 input_proj.P3
  - [[-1, 19], 1, SBA, []] # 21 SBA融合 (P3与P4)
  - [-1, 3, RepC3, [256, 0.5]] # 22, 输出 FPN_P3

  # --- 4. 融合 P3 -> P2 (Layer 1) ---
  # P2 在 Backbone 中是 Layer 1 (HGBlock Stage 1)
  - [1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 23 input_proj.P2
  - [[-1, 22], 1, SBA, []] # 24 SBA融合 (P2与P3)
  - [-1, 3, RepC3, [128, 0.5]] # 25, 输出 FPN_P2 (减少通道数以节省显存)

  # --- PANet (自底向上聚合) ---
  
  # P2 -> P3
  - [[22, 25], 1, SBA, []] # 26 (用回之前的 FPN_P3 和 FPN_P2)
  - [-1, 3, RepC3, [256, 0.5]] # 27, 输出 PAN_P3

  # P3 -> P4
  - [[19, 27], 1, SBA, []] # 28 (用回之前的 FPN_P4 和 PAN_P3)
  - [-1, 3, RepC3, [256, 0.5]] # 29, 输出 PAN_P4

  # P4 -> P5
  - [[16, 29], 1, SBA, []] # 30 (用回之前的 Y5 和 PAN_P4)
  - [-1, 3, RepC3, [256, 0.5]] # 31, 输出 PAN_P5

  # Detect (P2, P3, P4, P5)
  # 对应层级: 25(P2), 27(P3), 29(P4), 31(P5)
  - [[25, 27, 29, 31], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]